Autodesk.Revit.DB.ExportLayerKey.SubCategoryName
The subcategrory Name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.CategoryName
The category name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ExportLayerKey.#ctor(System.String,System.String,Autodesk.Revit.DB.SpecialType)
Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type.
categoryName:
The category name for the layer key.
subCategoryName:
The subCategoryName for the layer key.
num:
The special type for layer key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2014